<?php

namespace App\Languages;

use App\Languages\Contracts\Language;

class DeLanguage extends Language
{
    public const string CODE = 'de';

    public function getCode(): string
    {
        return self::CODE;
    }

    public function getIntroductionOrder(): array
    {
        return [
            'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'ö', 'ä', '#',
            'q', 'w', 'e', 'r', 't', 'z', 'u', 'i', 'o', 'p', 'ü', '+',
            '<', 'y', 'x', 'c', 'v', 'b', 'n', 'm', 'ß', ',', '.', '-',
            'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', 'Ö', 'Ä',
            'Q', 'W', 'E', 'R', 'T', 'Z', 'U', 'I', 'O', 'P', 'Ü',
            '>', 'Y', 'X', 'C', 'V', 'B', 'N', 'M', 'ẞ',
            '1', '2', '3', '4', '5', '6', '7', '8', '9', '0',
            '!', '"', '§', '$', '%', '&', '/', '(', ')', '=', '?', '°',
            '²', '³', '{', '[', ']', '}', '~', '|', '@', '€', 'µ', '\\',
            '*', ';', ':', '_', "'",
            'â', 'ê', 'î', 'ô', 'û',
            'á', 'é', 'í', 'ó', 'ú', 'ý',
            'à', 'è', 'ì', 'ò', 'ù',
            'Â', 'Ê', 'Î', 'Ô', 'Û',
            'Á', 'É', 'Í', 'Ó', 'Ú', 'Ý',
            'À', 'È', 'Ì', 'Ò', 'Ù',
        ];
    }

    public function getAllLetters(): array
    {
        return array_merge(
            range('a', 'z'),
            ['ß'],
            ['ä', 'ö', 'ü'],
            ['â', 'ê', 'î', 'ô', 'û'],
            ['á', 'é', 'í', 'ó', 'ú', 'ý'],
            ['à', 'è', 'ì', 'ò', 'ù'],
            range('A', 'Z'),
            ['ẞ'],
            ['Ä', 'Ö', 'Ü'],
            ['Â', 'Ê', 'Î', 'Ô', 'Û'],
            ['Á', 'É', 'Í', 'Ó', 'Ú', 'Ý'],
            ['À', 'È', 'Ì', 'Ò', 'Ù'],
        );
    }

    public function getVowels(): array
    {
        return [
            'a', 'e', 'i', 'o', 'u',
            'ä', 'ö', 'ü',
            'â', 'ê', 'î', 'ô', 'û',
            'á', 'é', 'í', 'ó', 'ú',
            'à', 'è', 'ì', 'ò', 'ù',
            'A', 'E', 'I', 'O', 'U',
            'Ä', 'Ö', 'Ü',
            'Â', 'Ê', 'Î', 'Ô', 'Û',
            'Á', 'É', 'Í', 'Ó', 'Ú',
            'À', 'È', 'Ì', 'Ò', 'Ù',
        ];
    }

    public function getSpecials(): array
    {
        return [
            '!', '"', '§', '$', '%', '&', '/', '(', ')', '=', '?', '°',
            '²', '³', '{', '[', ']', '}', '\\', '~', '|', '@', '€', 'µ',
            '#', '\'', ',', '.', ';', ':', '_', '-', '+', '*', '<', '>',
        ];
    }
}
