<?php

namespace App\Languages;

use App\Languages\Contracts\Language;

class FrLanguage extends Language
{
    public const string CODE = 'fr';

    public function getCode(): string
    {
        return self::CODE;
    }

    public function getIntroductionOrder(): array
    {
        return [
            'a', 'z', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p',
            'q', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'm',
            'w', 'x', 'c', 'v', 'b', 'n', ',', '.', ';', ':',
            '!', '?', '1', '2', '3', '4', '5', '6', '7', '8',
            '9', '0', '-', '=', '+',
            'à', 'â', 'æ', 'ç', 'é', 'è', 'ê', 'ë', 'î', 'ï',
            'ô', 'œ', 'ù', 'û', 'ü', 'ÿ',
            'A', 'Z', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P',
            'Q', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', 'M',
            'W', 'X', 'C', 'V', 'B', 'N', 'À', 'Â', 'Æ', 'Ç',
            'É', 'È', 'Ê', 'Ë', 'Î', 'Ï', 'Ô', 'Œ', 'Ù', 'Û',
            'Ü', 'Ÿ',
            '[', ']', '{', '}', '|', '\\', '"', '\'', '<', '>',
            '~', '`', '@', '#', '$', '%', '^', '&', '*', '(',
            ')', '€', '£', '¤', 'µ', '§', '°', '±', '²', '³',
        ];
    }

    public function getAllLetters(): array
    {
        return array_merge(
            range('a', 'z'),
            ['à', 'â', 'æ', 'ç', 'é', 'è', 'ê', 'ë', 'î', 'ï', 'ô', 'œ', 'ù', 'û', 'ü', 'ÿ'],
            range('A', 'Z'),
            ['À', 'Â', 'Æ', 'Ç', 'É', 'È', 'Ê', 'Ë', 'Î', 'Ï', 'Ô', 'Œ', 'Ù', 'Û', 'Ü', 'Ÿ'],
        );
    }

    public function getVowels(): array
    {
        return [
            'a', 'e', 'i', 'o', 'u', 'y',
            'à', 'â', 'æ', 'é', 'è', 'ê', 'ë', 'î', 'ï', 'ô', 'œ', 'ù', 'û', 'ü', 'ÿ',
            'A', 'E', 'I', 'O', 'U', 'Y',
            'À', 'Â', 'Æ', 'É', 'È', 'Ê', 'Ë', 'Î', 'Ï', 'Ô', 'Œ', 'Ù', 'Û', 'Ü', 'Ÿ',
        ];
    }

    public function getSpecials(): array
    {
        return [
            '!', '"', '#', '$', '%', '&', '\'', '(', ')', '*', '+', ',', '-', '.', '/',
            ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '^', '_', '`', '{', '|',
            '}', '~', '€', '£', '¤', 'µ', '§', '°', '±', '²', '³',
        ];
    }
}
