<?php

namespace App\Languages;

use App\Languages\Contracts\Language;

class FrLanguage extends Language
{
    public const string CODE = 'fr';

    public function getCode(): string
    {
        return self::CODE;
    }

    public function getIntroductionOrder(): array
    {
        return [
            'q', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'm', 'ù',
            'a', 'z', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p',
            'w', 'x', 'c', 'v', 'b', 'n',
            'é', 'è', 'ç', 'à',
            'â', 'ê', 'î', 'ô', 'û',
            'ë', 'ï',
            'œ',
            'Q', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', 'M', 'Ù',
            'A', 'Z', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P',
            'W', 'X', 'C', 'V', 'B', 'N',
            'É', 'È', 'Ç', 'À',
            'Â', 'Ê', 'Î', 'Ô', 'Û',
            'Ë', 'Ï',
            'Œ',
            '1', '2', '3', '4', '5', '6', '7', '8', '9', '0',
            '!', '"', '#', '$', '%', '&', '\'', '(', ')', '*', '+', ',', '-', '.', '/',
            ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '_', '{', '|', '}',
            '€', '£', '¤',
            'µ', '§', '°', '²',
            'ä', 'ö', 'æ', 'ü', 'ÿ',
            'Ä', 'Ö', 'Æ', 'Ü', 'Ÿ',
        ];
    }

    public function getAllLetters(): array
    {
        return array_merge(
            range('a', 'z'),
            ['ç'],
            ['é'],
            ['à', 'è', 'ù'],
            ['â', 'ê', 'î', 'ô', 'û'],
            ['ä', 'ë', 'ï', 'ö', 'ü', 'ÿ'],
            ['æ', 'œ'],
            range('A', 'Z'),
            ['Ç'],
            ['É'],
            ['À', 'È', 'Ù'],
            ['Â', 'Ê', 'Î', 'Ô', 'Û'],
            ['Ä', 'Ë', 'Ï', 'Ö', 'Ü', 'Ÿ'],
            ['Æ', 'Œ'],
        );
    }

    public function getVowels(): array
    {
        return [
            'a', 'e', 'i', 'o', 'u', 'y',
            'é',
            'à', 'è', 'ù',
            'â', 'ê', 'î', 'ô', 'û',
            'ä', 'ë', 'ï', 'ö', 'ü', 'ÿ',
            'æ', 'œ',
            'A', 'E', 'I', 'O', 'U', 'Y',
            'É',
            'À', 'È', 'Ù',
            'Â', 'Ê', 'Î', 'Ô', 'Û',
            'Ä', 'Ë', 'Ï', 'Ö', 'Ü', 'Ÿ',
            'Æ', 'Œ',
        ];
    }

    public function getSpecials(): array
    {
        return [
            '!', '"', '#', '$', '%', '&', '\'', '(', ')', '*', '+', ',', '-', '.', '/',
            ':', ';', '<', '=', '>', '?', '@', '[', '\\', ']', '_', '{', '|', '}',
            '€', '£', '¤',
            'µ', '§', '°', '²',
        ];
    }
}
