<?php

namespace App\Languages;

use App\Languages\Contracts\Language;

class PtLanguage extends Language
{
    public const string CODE = 'pt';

    public function getCode(): string
    {
        return self::CODE;
    }

    public function getIntroductionOrder(): array
    {
        return [
            'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'ç', 'º',
            'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '+',
            '<', 'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '-',
            'á', 'é', 'í', 'ó', 'ú',
            'â', 'ê', 'ô',
            'ã', 'õ',
            'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', 'Ç', 'ª',
            'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '*',
            '>', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', ';', ':', '_',
            'Á', 'É', 'Í', 'Ó', 'Ú',
            'Â', 'Ê', 'Ô',
            'Ã', 'Õ',
            '\\', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '\'', '«',
            '|', '!', '"', '#', '$', '%', '&', '/', '(', ')', '=', '?', '»',
            '¬', '@', '£', '§', '¢', '‡', '{', '[', ']', '}',
            '€', '©', '®', '™',
            'à',
            'À',
        ];
    }

    public function getAllLetters(): array
    {
        return [
            'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j',
            'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't',
            'u', 'v', 'w', 'x', 'y', 'z', 'ç',
            'á', 'é', 'í', 'ó', 'ú',
            'â', 'ê', 'ô',
            'ã', 'õ',
            'à',
            'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J',
            'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T',
            'U', 'V', 'W', 'X', 'Y', 'Z', 'Ç',
            'Á', 'É', 'Í', 'Ó', 'Ú',
            'Â', 'Ê', 'Ô',
            'Ã', 'Õ',
            'À',
        ];
    }

    public function getVowels(): array
    {
        return [
            'a', 'e', 'i', 'o', 'u',
            'á', 'é', 'í', 'ó', 'ú',
            'â', 'ê', 'ô',
            'ã', 'õ',
            'à',
            'A', 'E', 'I', 'O', 'U',
            'Á', 'É', 'Í', 'Ó', 'Ú',
            'Â', 'Ê', 'Ô',
            'Ã', 'Õ',
            'À',
        ];
    }

    public function getSpecials(): array
    {
        return [
            'º', '+', '<', ',', '.', '-',
            'ª', '*', '>', ';', ':', '_',
            '\\', '\'', '«',
            '|', '!', '"', '#', '$', '%', '&', '/', '(', ')', '=', '?', '»',
            '¬', '@', '£', '§', '¢', '‡', '{', '[', ']', '}',
            '€', '©', '®', '™',
        ];
    }
}
