<?php

namespace App\Languages;

use App\Languages\Contracts\Language;

class PtLanguage extends Language
{
    public const string CODE = 'pt';

    public function getCode(): string
    {
        return self::CODE;
    }

    public function getIntroductionOrder(): array
    {
        return [
            'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'ç',
            'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p',
            'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '-',
            'á', 'â', 'ã', 'à', 'é', 'ê', 'í', 'ó', 'ô', 'õ', 'ú', 'ü',
            'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', 'Ç',
            'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P',
            'Z', 'X', 'C', 'V', 'B', 'N', 'M', ';', ':', '_',
            'Á', 'Â', 'Ã', 'À', 'É', 'Ê', 'Í', 'Ó', 'Ô', 'Õ', 'Ú', 'Ü',
            '1', '2', '3', '4', '5', '6', '7', '8', '9', '0',
            '!', '"', '#', '$', '%', '&', '/', '(', ')', '=',
            '?', '«', '»', '\\', '|', '¬', '@', '£', '§', '¢',
            '€', '{', '[', ']', '}', '~', '^', '´', '¨', 'ª',
            'º', '±', '©', '®', '¼', '½', '¾', '×', '÷', '*',
        ];
    }

    public function getAllLetters(): array
    {
        return [
            'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j',
            'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't',
            'u', 'v', 'w', 'x', 'y', 'z',
            'á', 'â', 'ã', 'à', 'ç', 'é', 'ê', 'í', 'ó', 'ô', 'õ', 'ú', 'ü',
            'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J',
            'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T',
            'U', 'V', 'W', 'X', 'Y', 'Z',
            'Á', 'Â', 'Ã', 'À', 'Ç', 'É', 'Ê', 'Í', 'Ó', 'Ô', 'Õ', 'Ú', 'Ü',
        ];
    }

    public function getVowels(): array
    {
        return [
            'a', 'e', 'i', 'o', 'u',
            'á', 'â', 'ã', 'à', 'é', 'ê', 'í', 'ó', 'ô', 'õ', 'ú', 'ü',
            'A', 'E', 'I', 'O', 'U',
            'Á', 'Â', 'Ã', 'À', 'É', 'Ê', 'Í', 'Ó', 'Ô', 'Õ', 'Ú', 'Ü',
        ];
    }

    public function getSpecials(): array
    {
        return [
            '!', '"', '#', '$', '%', '&', '/', '(', ')', '=',
            '?', '«', '»', '\\', '|', '¬', '@', '£', '§', '¢',
            '€', '{', '[', ']', '}', 'ª',
            'º', '±', '©', '®', '¼', '½', '¾', '×', '÷',
            ',', '.', ';', ':', '_', '+', '*', '-',
        ];
    }
}
