<?php

namespace App\Languages;

use App\Languages\Contracts\Language;

class TrLanguage extends Language
{
    public const string CODE = 'tr';

    public function getCode(): string
    {
        return self::CODE;
    }

    public function getIntroductionOrder(): array
    {
        return [
            'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'ş', 'i',
            'q', 'w', 'e', 'r', 't', 'y', 'u', 'ı', 'o', 'p', 'ğ', 'ü',
            'z', 'x', 'c', 'v', 'b', 'n', 'm', 'ö', 'ç', '.',
            'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', 'Ş', 'İ',
            'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', 'Ğ', 'Ü',
            'Z', 'X', 'C', 'V', 'B', 'N', 'M', 'Ö', 'Ç', ':',
            '1', '2', '3', '4', '5', '6', '7', '8', '9', '0',
            '!', '@', '#', '$', '%', '^', '&', '*', '(', ')',
            '-', '=', '+', '[', ']', '{', '}', '|', '\\',
            ':', '"', '\'', '<', '>', '?', '~', '`', ',', '.', ';',
            '¡', '¢', '£', '¤', '¥', '§', '¶', '•', 'ª', 'º',
            '×', '–', '≠', '€', '®', '™', '←', '↑', '↓', '→',
            'þ', '¨', 'æ', '´', '÷', '©', '»', '«', '‹', '›',
            '°', 'µ', 'ß',
        ];
    }

    public function getAllLetters(): array
    {
        return [
            'a', 'b', 'c', 'ç', 'd', 'e', 'f', 'g', 'ğ', 'h',
            'ı', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'ö', 'p',
            'r', 's', 'ş', 't', 'u', 'ü', 'v', 'y', 'z',
            'A', 'B', 'C', 'Ç', 'D', 'E', 'F', 'G', 'Ğ', 'H',
            'I', 'İ', 'J', 'K', 'L', 'M', 'N', 'O', 'Ö', 'P',
            'R', 'S', 'Ş', 'T', 'U', 'Ü', 'V', 'Y', 'Z',
        ];
    }

    public function getVowels(): array
    {
        return [
            'a', 'e', 'ı', 'i', 'o', 'ö', 'u', 'ü',
            'A', 'E', 'I', 'İ', 'O', 'Ö', 'U', 'Ü',
        ];
    }

    public function getSpecials(): array
    {
        return [
            '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '-', '=', '+',
            '[', ']', '{', '}', '|', '\\', ':', '"', '\'', '<', '>', '?', '~',
            '`', ',', '.', ';', '¡', '¢', '£', '¤', '¥', '§', '¶', '•', 'ª',
            'º', '×', '–', '≠', '€', '®', '™', '←', '↑', '↓', '→', 'þ', '¨',
            'æ', '´', '÷', '©', '»', '«', '‹', '›', '°', 'µ', 'ß',
        ];
    }
}
